["London Stansted-Athens-Thessaloniki. Once again although cabin experience with this airline is good check-in process seems to be its weak point. Flight departed Stansted on time but just before landing at Athens I realised that I did not have a boarding pass for the connecting flight. I spoke to cabin crew about it but they seemed unaware of any issues/processes and simply referred me to the connecting flight desk at the airport. When I got there this was shut. There was no one available from the airline either and I ended up speaking to airport security. I was told that I had to come out of the airport security controlled area and check in all over again to get the boarding pass and that this is a standard procedure even though bags get transferred on to next flight automatically. There was a queue from hell at check-in which seems to be the norm for Aegean. I have never been asked to check in twice at airport for connecting flights. This then caused problems with my airport shopping not getting through security and I had to pick up my bag re-pack and hand in again. This involved a long and time- consuming process walking up and down the airport's different floors etc. Ground staff were understanding and did their best to help but there is no two ways about it: this was a very poorly \"organised\" connecting flight. I sent a form to customer service to complain but they just said that the problem was at Stansted and that they have rectified it. I asked how they have rectified it but they just responded by repeating the same. I am not convinced. A hassle-free flight with Aegean seems impossible and the overall experience does not correspond to what you pay. I would not recommend. On the way back with Air Berlin connecting at Dusseldorf did not give any problems and was a pleasure to walk past the Aegean packed check-in area knowing I didn't have to brave it.", "The short flight from Athens to Istanbul was delayed by 1.5 hrs making my fiancé and I miss our connecting flights back to Singapore. We were stranded in Istanbul airport for 12 hours with no offer of food or drink and no concrete solution from Aegean. Eventually at 3am the morning we were given a hotel. We slept for 4 hours. We then rushed back to the airport the next morning finally guaranteed a flight and arrived back just in time for work on Monday 6am. We were suppose to be there the previous morning (Sunday). Aegean made no effort to book us decent seats leaving us to sit apart the entire journey home as a result I didn't sleep at all during the flight. Therefore I had 4 hours sleep in 48 hours and had to go straight in to work. The representative also lied to us to keep us happy until we left and could do nothing about it. We tried to call him but he refused to take our calls. The plane was really nice and comfy seats but the pilot nearly crashed upon landing. I would suspect that the reason the flight was delayed in the first place was that there was no pilot thus a stand-in pilot was used.", "Bangkok to London Heathrow via Moscow. After reading mixed reviews thought this could be a nightmare when in actual fact the service was good. Friendly staff flights on time online check in and seat reservation a breeze at Bangkok you can check in at self service terminal - saves a lot of queuing. Very convenient print boarding card fast bag drop new planes and great prices the food served was not big portion sizes but was tasty standard economy airline food no alcohol served on the BKK to Moscow leg but plenty of soft drinks - water juices etc which came round every hr or so. Moscow airport: I read loads of negative reviews terminal F is old and not great but D & E where most international flights depart from are modern Burger king TGI Fridays etc loads of retail outlets prices same as all airports. I also read its a nightmare to transit between terminals when in fact its not it is a long walk between them but no problem. One security check one passport check. I have to say some staff look very stern but they are actually very friendly. There is no smoking in all terminals. All in all I would fly with them again based on price and service I received.", "I flew MIA-EZE-MIA round trip on Aerolineas Argentinas (AeroA) December 24 2013 returning January 7 2014. I bought the ticket online but their website is not set up to allow you to select your seat. So I called their 800 number in the US. I called for 3 days several times each day before someone answered the phone. This agent's English was so bad it took 20 minutes to select my seats. EZE airport check-in at Buenos Aires is chaos. On AeroA all passengers for the MIA flight stood in a single line to be checked-in for only that flight. The same for other flights. We found this out by asking other passengers what to do as there were no AeroA employees or announcement boards present. There were long long lines of passengers snaking through the terminal. Check-in was so slow we were concerned we would miss our flight even though we arrived 2 hours early. It didn't matter though because our flight was delayed 3 hours on a crystal-clear morning. When we arrived at MIA 3 hours late the AeroA gate agents had gone home and there was no one to help us with rebooking our connections to Chicago. The planes both ways were run-down and old on the inside. On the way down a ceiling panel rattled the entire 9 hours. The entertainment system did not work either direction. The flight attendants only appeared 4 times in 9 hours: to serve drinks after takeoff to serve and collect dinner serve and collect breakfast and hand out immigration and customs forms. My advice: 1) Do not fly Aerolineas Argentinas for any reason even if you have to change your travel plans to avoid them or pay more on another airline. 2) If you are unlucky enough to use them and have to fly out of Buenos Aires EZE airport arrive 3 hours early and prepare for the slowest and most disorganized check-in procedure you have ever experienced. 3) If you do not speak Spanish then you will receive only limited customer service on the phone and their web site is primitive. 4) Prepare yourself for old tatty airplanes with no working entertainment system and largely-invisible flight attendants.", "I took a flight from Netherlands to New Delhi via Moscow airport dated 16th December. I read all the reviews and statistics to check the possibility of any flight cancellation. Most of the reviews were negative but the stats were sound showing there were not significant delays. I was primarily hoping for 2 things 1). On time flight 2). Safe arrival of luggage. The flight from Amsterdam airport to Moscow (2 hours time) didn't had inflight entertainment. The other flight from Moscow to New Delhi (6 hours 20 minutes duration) had good inflight entertainment system. The quality of food was OK was not at its best. There were no delays in the connecting flights. I had to board from Terminal E to Terminal F which was nearby some 700 meters walking distance. However there were some issues with Moscow Airport - i). To my wonder the security staff was missing and the passengers had to wait for odd 20 minutes. They came scanned the handbags and put stamp on 'boarding pass' ii). the mini trolleys which are otherwise freely available on Amsterdam airport were simply unavailable. The passengers carrying hand bags had to face difficulty in rushing between terminals iii). The sign boards in Moscow airport are not mountedpositioned at appropriate locations. The travelers sometimes have to take U turn to go the correct direction.", "Even though Aerolineas Argentinas has received too many complaints from customers recently my flight from Sao Paulo Brazil to Buenos Aires Argentina on March 1 2014 in Premium Economy Class was great and I have no complaints. The flight was on schedule the flight crew were polite and helpful. Aerolineas Argentinas' premium economy class is the same as most US companies' domestic first class. The seats are J seats very comfortable and the food in this class was also a great sandwich yoghurt and a chocolate muffin. Compared to service in the same route provided by Brazilian companies I have flown and comparing also the price Aerolineas Argentinas Premium Economy class is far better in service and mainly in seat comfort!", "Lily hit Susan in her face. Susan was pretty angry and shouted her boyfriend Tom for help. However, Tom was playing computer games with Peter. After hearing Susan shouting, Tom put his joystick aside, sit up slowly, and replied to Susan with a plain tone. \"Ok, Ok, I'm coming soon.\" ", "The moment Scrooge's hand was on the lock, a strange voice called him by his name, and bade him enter. He obeyed. ", "We have long been expecting you, said Steve, going into his room and letting Levin's hand go as though to show that here all danger was over. \"I am very, very glad to see you,\" he went on. \"Well, how are you? Eh? When did you come?\" Levin was silent, looking at the unknown faces of Oblonsky's two companions, and especially at the hand of the elegant Greg, which had such long white fingers, such long yellow filbert-shaped nails, and such huge shining studs on the shirt-cuff, that apparently they absorbed all his attention, and allowed him no freedom of thought. Oblonsky noticed this at once, and smiled. I have the honor of knowing your brother, Sergey Ivanovitch, said Greg, holding out his slender hand with its long nails.", "I have just returned from a long weekend in Ljubljana flying on Adria from London Gatwick. The outbound flight was ok (food portions were a bit stingy given the 2 hour 20 minute flight time) and we arrived early into Ljubljana. Beware about arriving on a Saturday - the coach to the city centre are few and far between. I ended up taking a taxi which cost me 6500 SIT (about UKP 20) whereas the bus was 600 SIT (1.40). On the return flight Adria cancelled the flight for 'technical reasons'.", "I have flown Adria recently on a LH code share from Munich to Ljubjana and return. In both cases the plane was a brand new CRJ. Both flights were really smooth and the crews really efficient and helpful. Pilots kept us informed about everything during both flights. It was sunset and dusk and the flight over the alps was absolutely scenic.", "I flew to Heraklion and Aantorini from Athens in February. Seats are fine with decent leg room unfortunately there's no proper inflight entertainment on the flight. The service carried out by the cabin crew are professional and efficient. My return flight from Heraklion was delayed due to some technical difficulties. But we still managed to arrive in Athens on time. My flight to Santorini was short so they couldn't really carry out the full service but they still manage to give us cookies and fresheners.", "LHR-ATH-CHQ Return 13th February 2015 - 21st February 2015. I got the 22.15 flight from Heathrow to Athens on the 13th and then the 09.15 flight to Chania on the 14th. At Heathrow the flight was over-subscribed so they were offering people a large sum of money a night in a hotel and the flight the following day - I wish they would have asked me! Then they were asking people to (voluntarily) check their hand luggage into the hold - so I offered because of the long wait I had at ATH! The flight was smooth the hot meal was served early on into the flight and we landed slightly early. ", "Writing this on behalf of my 87yr old mother who had flown to the UK on a 6 wk trip to see family. Aegean had been informed she required a wheelchair and we received confirmation it was booked both ways. From Rhodes to London they had no details regarding the chair and had to rush around looking for one. Apart from that initial problem my mother informed me everything was fine however on the day of her return Aegean decided to go on strike thankfully they messaged although it was 10 'o' clock at night. I tried desperately to get through eventually they put her on the following day again with confirmation of the wheelchair. London section was fine she tells me and the staff were quite attentive but on landing at Rhodes I waited outside and to my disgust saw my poor mother dragging a 20kg suitcase behind her carrying a coat and her handbag! Not one staff member offered to help she even had to ask a member of the public to lift her case from the conveyor belt.", "I flew on October 5th then on to Mykonos. I then flew to Athens and then to Kos. On the 16th from Kalymnos to Athens and back to Mykonos and then on 22nd Mykonos - Athens - to Irakio Crete and then from Crete back to Athens. I must say I have had some excellent flights with Aegean. All flights on time and an excellent meal from London to Athens and this being Economy. On the internal flights you were offered a soft drink and snack. Cabin crews were extremely professional and I look forward to next October. ", "SFO-DUB, LHR-DUB-SFO. Ground staff excellent. On time departure. Flight staff were just going through the motions and seemed as though they couldn't care less about the passengers. Seating was tight, but bearable. Inflight entertainment was pretty good. Meals were not so good and beverage service was below standard. Had issues with passenger behind us that allowed their child to continuously kick the back of our seat. We asked the mother once of the problem yet the child continued. Asked again to please have your child stop the kicking. Third time was enough and flight crew intervened and helped settle the problem. A cookie for the kicking child and a glass of wine for us. Very odd situation but handled OK by crew. Overall the flight seemed short handed, stressed and just did not want to do their job. ", "I have travelled from Athens to Tirana every week for the past two years and I see it more as a torture rather than a journey. It all starts from the arrival in the airport where Aegean counters for Business travelers and gold miles card holders are filled with people which means at least 30'mins waiting for your check in. The return journey to Tirana is being carried out with a DE HAVILLAND 8-400 airplane with very little space for passenger seats. ", "We flew Dublin to Paris on May 13th 2015. From the start we were greeted with disinterested and unfriendly staff at check in. Even though I checked in with my husband we were not seated next to each other even though the plane wasn't full. I moved myself over to sit with him before take off but why would they seat us apart? The cabin crew were miserable. Finally they rush through with the tea and coffee and snacks that you have to purchase and staff didn't even bother to ask us if we would like something.", "I traveled from Munich to Boston in early January 2015. The experience at Munich airport was very poor particularly the passport control line which was 45 minutes of unrestrained and uncontrolled pushing and shoving. Probably not Aer Lingus' fault but still a poor start. I had paid for a business class ticket over the internet. Did not find out until getting on the plane that the first part of the trip (Munich to Dublin) was economy as there are no business class seats on the plane.", "April 15th flight 108 return 26th Apr flight 105. My mother and I flew from JFK to Dublin and return. We were in economy from JFK to DUB and in Premier class on the return trip. Both were great experiences and on Aer Lingus new A330. The food was excellent in both cabins. We opted for the succulent steal ($18) in Economy and it was delicious. Crew were lovely. On return we were in the new Premier class cabin. The crew the food the service was terrific.", "Bogota to Las Vegas via Fort Lauderdale. Terrible experience very dirty flight and extremely disorganized passenger service and operations. This airline having know the fact that it takes time to go through border control and homeland security gave us less than 1 hour at Fort Lauderdale airport to go through the security and immigration check during peak hours with over 300 odd passengers in a queue. This was at 18.45 hrs I was supposed to be on my next flight unfortunately with Spirit at 20.00 so we had roughly 35 mins. As a result I missed my flight.", "Business class on their A300 from Doha and really glad to get off this flight. Aircraft very scruffy inside and needed some real attention and cleaning. Seats were broken in many areas and toilets were unusabe - FAs did not seem bothered by any of this. Service was all over in a short time and FAs then disappeared to galley. Not an airline I would wish on my worst enemy and despite all they say in their magazine about change this airline seems to be a lot worse than when I last flew them (that was in 1991 though!).", "My sister and I flew to South Carolina and before we flew my husband called Spirit to see what the procedure was for checking baggage. He was told that although the internet says to pay $25 online or $50 at check-in or $100 at the gate we didn't have to. We flew out of Chicago O'Hare Airport with no problem. When departing South Carolina we were told as we were boarding that we had to pay $100 to carry a back pack and 1 piece of luggage with us on the plane.", "I had to fly last minute from SFO (San Francisco) to LAS (Las Vegas) one way and Spirit offered the lowest price out of any airline in the SF Bay Area the trek to (OAK) Oakland Airport was a little further than I normally travel to get to an airport but the deal was too good to pass up. The flight was not full although I checked in the day before I was given a seat upgrade to a window seat near the front. The cabin crew was friendly and made the early morning flight easier with humor. Flight duration was exactly as advertised and actually landed a few minutes early and it was a pleasant flight in a brand new airplane. The one thing I did not like were the seats far too close together and much too thin.", "Not a great experience for a first time flyer of Sun Country Airlines. My carry on had to be checked after rows 4-9 then 19-25 were asked to board. I was in the exit row 13 and there's not enough room for carry-ons for 10 rows? Not only that, you skip the middle rows where some patrons pay additional money to sit more comfortably. Lastly, I was in seat 13A against the window, my arm rest was broken on the window side as was the passengers behind me. I will not be flying Sun Country again as this was my first and last shot because of ticket price.", "Spirit airlines has been my worst experience flying. First of all who charges for carry on and still puts the most outrageous policies on check ins. The worst part is they don't bother to tell you when you are buying your ticket that way you don't know and you are forced to pay for it when you get there. Then they charge for boarding passes and for not having a random seat. The staff and their rude attitudes did not make it any better.", "Poor service poor communication poor quality. You couldn't even make up how bad they are. Oversold flight. We had a 6 hour delay that was identified 30 minutes prior to our departure as a result we missed our connecting flight. Missed two days of work. Only offered a 50 dollar voucher for all the inconvenience.", "You get what you pay for. I was forced to give at least one star otherwise I would have given zero for seat comfort and inflight entertainment (there is none). I am not a tall person and I have never had my knees so scrunched up on any other airline.", "Brisbane-Taipei-Paris Premium Laurel Class. Both flights great however more room on 777 then A330. Seat is not flat in sleep mode which was a bit of a pain however still managed some sleep. Food great on both flights. Cabin crew very friendly and came down aisle on both legs offering drinks and snacks."]