["Clear cell tumors are part of the surface epithelial-stromal tumor group of Ovarian cancers, accounting for 6% of these neoplastic cases. Clear cell tumors are also associated with the pancreas and salivary glands. Benign and borderline variants of this neoplasm are rare, and most cases are malignant. Typically, they are cystic neoplasms with polypoid masses that protrude into the cyst. On microscopic pathological examination, they are composed of cells with clear cytoplasm (that contains glycogen) and hob nail cells (from which the glycogen has been secreted). The pattern may be glandular, papillary or solid.", "Two Japanese scientists commenced research into inhibitors of HMG-CoA reductase in 1971 reasoning that organisms might produce such products as the enzyme is important in some essential cell wall components. This work lead to the identification of the first clinically useful compound lovastatin(mevinolin) from a mould in the mid 1970's. This agent was first used in the more severe forms of hypercholesteraemia in the 1980s followed by landmark trials with simvastatin that showed the potential for cardio-prevention. Cerivastatin was withdrawn in 2001 because of a ten times higher incidence of rhabdomyolysis than the other statins.", "Symptoms of vulvovaginitis caused by Candida species are indistinguishable and include the following: Pruritus is the most significant symptom Change in the amount and the color of vaginal discharge: It is characterized by a thick, white \"cottage cheese-like\" vaginal discharge Pain on urination (dysuria) Pain on sexual intercourse (dyspareunia) Vulvovaginal soreness Symptoms aggravate a week before the menses", "Hepatitis E is self-limited in most immunocompetent patients. For these cases the prognosis is good. Immunocompromised patients, and those with end-stage liver disease are at higher risk of developing chronic hepatitis and other complications. This last group of patients has poor prognosis. The mortality rate of hospitalized patients with hepatitis E is 0.5 - 4%. In developing countries, mortality rate during epidemics is 0.2 - 4.0%. In these countries, mortality rate in pregnant women ranges from 10 - 25%, and is often due to fulminant hepatic failure, hemorrhage or eclampsia.", "The majority of patients with leiomyosarcoma remain asymptomatic for decades. General symptoms associated with cancer may occur including fatigue, fever, weight loss, nausea and vomiting, vaginal bleeding, vaginal discharge, feeling of pressure in abdomen or pelvic, painless growing lump in abdomen or pelvic cavity.", "Protein C's anticoagulant role in the human body was first noted by Seegers et al. in 1960, who gave protein C its original name, autoprothrombin II-a. : 6822 Protein C was first isolated by Johan Stenflo from bovine plasma in 1976, and Stenflo determined it to be a vitamin K-dependent protein. He named it protein C because it was the third protein (\"peak C\") that eluted from a DEAE-Sepharose ion-exchange chromotograph. Seegers was, at the time, searching for vitamin K-dependent coagulation factors undetected by clotting assays, which measure global clotting function. Soon after this, Seegers recognised Stenflo's discovery was identical with his own. : 6822 Activated protein C was discovered later that year, and in 1977 it was first recognised that APC inactivates Factor V a. : 2382 In 1980, Vehar and Davie discovered that APC also inactivates Factor VIII a, and soon after, Protein S was recognised as a cofactor by Walker. In 1982, a family study by Griffin et al. first associated protein C deficiency with symptoms of venous thrombosis. Homozygous protein C deficiency and the consequent serious health effects were described in 1984 by several scientists. : 1214 cDNA cloning of protein C was first performed in 1984 by Beckmann et al. which produced a map of the gene responsible for producing protein C in the liver. In 1987 a seminal experiment was performed (Taylor et al.) whereby it was demonstrated that activated protein C prevented coagulopathy and death in baboons infused with lethal concentrations of E. coli. : 2382 In 1993, a heritable resistance to APC was detected by Dahlbäck et al. and associated with familial thrombophilia. In 1994, the relatively common genetic mutation that produces Factor V Leiden was noted (Bertina et al.). Two years later, Gla-domainless APC was imaged at a resolution of 2.8 Ångströms. α› Beginning with the PROWESS clinical trial of 2001, it was recognised that many of the symptoms of sepsis may be ameliorated by infusion of APC, and mortality rates of septic patients may be significantly decreased. : 3161,6 Near the end of that year, Drotrecogin alfa (activated), a recombinant human activated protein C, became the first drug approved by the U.S. FDA for treating severe sepsis. In 2002, Science published an article that first showed protein C activates protease-activated receptor-1 (PAR-1) and this process accounts for the protein's modulation of the immune system.", "The health care provider will determine whether the child has this disorder, or a similar condition such as childhood schizophrenia or pervasive developmental disorder (autism). The most important sign of childhood disintegrative disorder is the loss of developmental milestones. Generally, the diagnosis is made if the child has lost function in at least two areas of development.", "A bad vagal reaction in a freshly implanted stent or in a patient awaiting PCI who has a significant LM lesion can be very hazardous (risk of thrombosis, or a downward spiral of poor perfusion leading to subendocardial ischemia leading to poorer LV function, leading to poorer forward output). Some operators will preemptively administer an ampule of atropine prior to the sheath pull or will have a low threshold to administer a full ampule of atropine.", "The cause of focal segmental glomerulosclerosis is usually unknown. Known causes include: Heroin use HIV Inherited genetic problems Obesity Reflux nephropathy (a condition in which urine flows backward from the bladder to the kidney) Sickle cell disease", "There is no vaccine to prevent Lassa fever. Primary transmission of the Lassa virus can be prevented by avoiding contact with Mastomys rodents, especially in the geographic regions where outbreaks occur. When caring for patients with Lassa fever, further transmission of the disease through person-to-person contact or via nosocomial routes can be avoided by taking preventive precautions against contact with patient secretions.", "In acute aortic insufficiency symptoms of heart failure often develop acutely. Chronic aortic insufficiency is usually insidious and progressive and the patient may remain asymptomatic for years. Once left ventricular dilation and left ventricular failure occur, dyspnea on exertion and exercise intolerance begin to occur. Later symptoms such as angina, syncope, and other symptoms of heart failure are present.", "The lifelong diet can be difficult and socially troublesome, especially in young patients, but it is crucial in order to avoid serious health consequences. Teenagers in particular occasionally rebel against the dietary strictures and suffer relapses or complications as a result. The widespread use of wheat byproducts in prepared food, soups and sauces can make dining out problematic. This is especially true in the United States, where dermatitis herpetiformis disease is less widely-known among the wider population than it is in Europe. However, certain types of restaurants (e.g., Japanese, Thai, Indian, and Latin American) already offer a wide range of gluten-free menu options, and many major restaurant chains have responded to growing awareness of celiac disease (and by default dermatitis herpetiformis) by posting information about the gluten content of their menu items on their websites. It is important for friends and family to understand that dermatitis herpetiformis is present for life. As celiac disease has become better understood, the availability of gluten-free replacements for everyday treats such as muffins, bagels, pasta and the like has continually improved, as has their quality. This has also benefited those with dermatitis herpetiformis. People with dermatitis herpetiformis and/or celiac cannot eat only gluten-free foods but continue to consume one or two products that contain gluten. For example, drinking beer can still cause symptoms, but even this problem may now be overcome. There are many specialty brews around the world that may be described as gluten free beer. However, the case of beer raises the main problem of dermatitis herpetiformis and celiac disease: while the diet is strict and the effects of the disease are serious, the main symptom of the disease can be social isolation with those with dermatitis herpetiformis afraid to become involved in normal social life. Parties can be difficult, weddings and funerals hard, holidays awkward, a meal out a nightmare, travel is made more stressful, and even the trip to a bar or pub one that requires the individual to be constantly aware of the disease. It is too easy for the celiacs and those with dermatitis herpetiformis to withdraw from these normal activities, and many people with these complaints are working to create normal activities where they can forget the problem. It is important for newly diagnosed with either dermatitis herpetiformis or celiacs to ensure that they remain involved in their social life and explain their needs to family and friends. Although these diseases may tend to isolate individuals with the complaint, the situation is becoming less difficult year by year. Manufacturers are now making a wide range of very acceptable breads, and some pastas (notoriously horrible in the past) that are virtually indistinguishable from normal pasta. Restaurants are beginning to offer gluten free menus and are recognizing the size of the market that is largely not catered for. Celiacs and those with dermatitis herpetiformis should not be afraid to ask establishments how they can cater to them. Where the question has been asked repeatedly, the proprietors tend to recognize the need, and become aware of the revenue that is lost where they do not provide a full range of products. In many ways beer seems to be the hardest gluten free product to \"get right\". However, gluten-free beer is now available and there is now a range of ales, beers, and lagers to choose from. Around the world standards of \"gluten free\" vary. For example, while in the United Kingdom a beer with less than 20 parts per million gluten (20ppm) is \"gluten free\", in Australia it is not possible to describe any product as such if any gluten can be detected at all. Similarly, some \"gluten free\" breads can contain low levels of gluten in one country, in another they would contravene labeling or food standards legislation. However, large scale commercial beers are out of the question for those who cannot consume gluten, regardless of the sometimes misleading advice on some brewery websites. It is likely that most people with dermatitis herpetiformis celiacs will be able to drink beer at under 20ppm (in moderation) without causing themselves any harm. It is important, however, for consumers of all \"low gluten\" foods and beverages to tell their consultant, and to ensure that even if the obvious symptoms are absent, there are no other negative effects continuing that they are unaware of. However, the development of a range of gluten free beers is an example of those who cannot consume gluten \"working together to socialize normally and avoid isolation caused by their special dietary needs. It also represents part of the return to a normal life.\"", "The following criteria are required in order to diagnose JMML: All 3 of the following: No Philadelphia chromosome or BCR/ABL fusion gene. Peripheral blood monocytosis >1 x 109/L. Less than 20% blasts (including promonocytes) in the blood and bone marrow (blast count is less than 2% on average) Two or more of the following criteria: Hemoglobin F increased for age. Immature granulocytes and nucleated red cells in the peripheral blood. White blood cell count>1 x 109/L. Clonal chromosomal abnormality (e.g., monosomy 7). Granulocyte-macrophage colony-stimulating factor (GM-CSF) hypersensitivity of myeloid progenitors in vitro. These criteria are identified through blood tests and bone marrow tests. Blood tests: A Combined Blood Count (CBC) will be performed on a child suspected of having JMML and throughout the treatment and recovery of a child diagnosed with JMML. NOTE: JMML can show many of the same signs as infectious diseases like Epstein-Barr virus, cytomegalovirus, human herpesvirus 6, histoplasma, mycobacteria, and toxoplasma. Therefore, it is important that your doctor rule out these other potential causes of your child's symptoms during the diagnosis process.", "Zaspopathy, also called ZASP-related myofibril myopathy, is a novel autosomal dominant form of progressive muscular dystrophy, first described in 2005. The disease encompasses multiple forms of both distal and proximal myopathies, and is caused by mutations in the gene referred to as ZASP.", "Physical examination of patients with cystic nephroma is usually remarkable for a palpable abdominal mass.", "Practitioners and advocates of alternative therapies often recommend eye exercises and relaxation techniques such as the Bates method. However, the efficacy of these practices is disputed by scientists and eye care practitioners. A 2005 review of scientific papers on the subject concluded that there was \"no clear scientific evidence\" that eye exercises were effective in treating myopia. In the eighties and nineties, there was a flurry of interest in biofeedback as a possible treatment for myopia. A 1997 review of this biofeedback research concluded that \"controlled studies to validate such methods... have been rare and contradictory.\" It was found in one study that myopes could improve their visual acuity with biofeedback training, but that this improvement was \"instrument-specific\" and did not generalise to other measures or situations. In another study an \"improvement\" in visual acuity was found but the authors concluded that this could be a result of subjects learning the task Finally, in an evaluation of a training system designed to improve acuity, \"no significant difference was found between the control and experimental subjects\" Various methods have been employed in an attempt to decrease the progression of myopia. Altering the use of eyeglasses between full-time, part-time, and not at all does not appear to alter myopia progression. Bifocal and progressive lenses have not shown significant differences in altering the progression of myopia.", "Effects on insulin resistance In all animal models of insulin resistance, moxonidine had striking effects on the development of insulin resistance, hyperinsulinaemia and impaired glucose homeostasis. Given the importance of insulin resistance as a risk factor for cardiovascular disease, it is of considerable relevance that it has been shown to improve insulin sensitivity. Based on animal models, it has demonstrated that moxonidine is capable of: normalising plasma insulin levels improving glucose uptake in peripheral cells lowering lipid levels decreasing food intake and reducing weight gain in obese animals. Renal function Evidence is accumulating to show that sympathetic overactivity is substantially involved in the development and progression of chronic renal failure, contributing to a poor overall cardiovascular prognosis. Moxonidine has been shown to reduce structural renal damage in various models of renal failure. Cardiac structure In spontaneously hypertensive rats, moxonidine significantly reduced total heart weight, left ventricular weight and the ratio of ventricular weight to body weight compared with an untreated control group.", "Adjustment disorder is an emotional and behavioral reaction that develops within 3 months of a life stress, and which is stronger or greater than what would be expected for the type of event that occurred."]